#################################################
# インポート
#################################################
import discord
import os
from os.path import join, dirname
from dotenv import load_dotenv

#################################################
# クライアント作成(デコレータ作成のためこの位置に)
#################################################
client = discord.Client()

#################################################
# 関数
#################################################

#################################################
# デコレータ
#################################################

# 起動時に動作する処理
@client.event
async def on_ready():
    # 起動したらターミナルにログイン通知を表示
    print('ログインしました')

# メッセージ受信時に動作する処理
@client.event
async def on_message(message):
    
#################################################
# 実行文
#################################################
# Botの起動とDiscordサーバーへの接続
dotenv_path = join(dirname(__file__), '.env')
load_dotenv(dotenv_path)

BOT_TOKEN = os.environ.get("DISCORD_BOT_TOKEN")
client.run(BOT_TOKEN)